
** Load and validate cards
#+BEGIN_SRC python :session session_day_4 :results output
from pydantic import BaseModel
try:
  import re
  class Card(BaseModel):
    id: int
    numbers: list[int]
    winning: list[int]

    def dump(self):
      print(f"Card {self.id}: {' ' .join([str(x) for x in self.winning])} | {' '.join([str(x) for x in self.numbers])}")

  class Cards(BaseModel):
    cards: list[Card]

  def load_cards(path) -> Cards:
    cards = Cards(cards=[])

    with open(path) as f:
      for idx, line in enumerate(f.read().split("\n")):
        if not line:
          continue
        m = re.search(r"^Card +(\d+): ([\d ]+) \| ([\d ]+)$", line.strip())
        if not m:
          raise Exception(f"Missing data on line {idx+1}")
        id, winning, numbers = m.group(1),m.group(2),m.group(3)
        # list(set( to force the lists unique (this changes the ordering...)
        cards.cards.append(Card(id=id, numbers=list(set([int(n) for n in numbers.split(' ') if n != ''])), winning=list(set([int(n) for n in winning.split(' ') if n != '']))))

    return cards

  cards = load_cards("input.txt")
  print(f"Loaded {len(cards.cards)} cards")
except Exception as e:
  print("Error:",e)
#+END_SRC

#+RESULTS:
: Loaded 219 cards

*** Solution
#+BEGIN_SRC python :session session_day_4 :results output
try:
  def star_1(cards: Cards) -> int:
    total = 0
    for card in cards.cards:
      winning_count = len([n for n in card.numbers if n in card.winning])
      if winning_count:
        total += 2**(winning_count-1)

    return total

  print(star_1(cards))
except Exception as e:
  print("Error:",e)
#+END_SRC

#+RESULTS:
: 33950


